SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-62700-A

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( D49_YORKSHIRE.S )
Size  ( 2.7m 3.9m 10.4m )
WheelRadius ( 18.625in )comment (Front Bogie)
Mass ( 65.55t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 5cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 180kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)

MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )

MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 11.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 4577 )
ORTSDavis_B ( 21.92 )
ORTSDavis_C ( 5.342 )

ORTSWagonFrontalArea (100)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights ( 4
  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
    Headlight ( 0 )
    Unit ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 80ff7200 )
     Position ( -0 2.3 -3.4 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 80ffe610 )
     Position ( -0 2.3 -3.4 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
         
        )
      )
   )

  Light (
   comment( Head light right )
    Type  ( 0 )
    Conditions (
       Headlight ( 4 )
       Unit ( 2 )Service( 2 )
      )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 1
       State (
         Duration ( 0.0 )
         LightColour ( ccccaaaa )
         Position ( -1 1.41 4.84 )
         Azimuth ( 0 0 0 )
         Transition ( 0 )
         Radius ( 0.45 )
        )
      )
   )
  Light (
   comment( Head light left )
    Type  ( 0 )
    Conditions (
       Headlight ( 4 )
       Unit ( 2 )Service( 2 )
      )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 1
       State (
         Duration ( 0.0 )
         LightColour ( ccccaaaa )
         Position ( 1 1.41 4.84 )
         Azimuth ( 0 0 0 )
         Transition ( 0 )
         Radius ( 0.5 )
        )
      )
   )
  )
	
Comment( ******* Miscellaneous Wagon Information************ )


Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( D49_YORKSHIRE.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.2 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17eng.sms" )
)

Engine ( OR-62700-A

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)
   WhistleFX
   (
    0 3.9 -2.7
    0 1 0
    0.08
   )

   SafetyValvesFX
   (
    0 3.885 -2
    0 1 0
    0.25 
   )

   StackFX
   (
    0 4.25 3.0
    0 1 0
    0.2
   )

   DrainpipeFX
   (
    -1.5 1.258 -3.886
    -0.4 -1 -0.2
    0.05
   )
			
Injectors2FX
	(
	-1.2 1 -5
	0 -1 0
	0.12
	)
Injectors1FX
	(
	1.2 1 -5
	0 -1 0
	0.12
	)
   CylindersFX
   (
    -1.19 0.39 3.7
    0 0 1
    0.14
   )

   CylindersFX
   (
    1.19 0.39 3.7
    0 0 1
    0.14
   )
  )
)

Wagon ( OR-62700-A )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 40in )
NumWheels ( 2 )
ORTSDriveWheelWeight ( 42t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 189ft^3 )  
ORTSEvaporationArea ( 1429.4ft^2 )
ORTSSuperheatArea ( 302.5ft^2 )
MaxBoilerPressure ( 180psi )
MaxSteamHeatingPressure ( 50psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 17in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 26ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 5t-uk )
MaxTenderWaterMass ( 35000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

ORTSBoilerEvaporationRate ( 15.92 )   Comment(Set to acheive max steaming rate from grate)

Comment(ORTSMaxIndicatedHorsepower ( 1132.0hp ))   

ORTSMaxSuperheatTemperature ( 225.0 )   

ORTSBoilerEfficiency( 0.0 0.91  190.0 0.455 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
xORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.65 0.65 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
          Notch(0    0 TrainBrakesControllerReleaseStart )
          Notch(0.1  0 TrainBrakesControllerRunningStart )
          Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 0.55 NumNotches ( 0 ) )


FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( B1.cvf )
HeadOut (  -1.423 3.0 -3.2 )
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17cab.sms" )
Name ( "62700 D49/1, YORKSHIRE, Express Passenger, TE 21.56Klbf" )
Description (
"Much of the initial design work on the D49/1s was performed by Chief Locomotive Draughtsman, R.J. Robson at Darlington, and included a mixture of Darlington and Doncaster practices. The three cylinders and steam chest were in one complete casting, following the Darlington practice introduced by Raven on his C7 Atlantics (NER Class Z). Another Darlington practice was the use of inside steam pipes instead of the Doncaster-style outside pipes. Doncaster practice came to the fore with the use of Gresley's conjugated valve gear on the middle cylinder. The coupled wheels were the Doncaster passenger standard of 6ft 8in diameter, while the bogie wheels followed the Darlington standard of 3ft 1.25in diameter.
A distinctive feature on the D49/1 piston valve engines, were the rectangular boxes fitted on the running boards just behind the smokebox. These boxes were sheet metal covers that housed the top of the expansion link in the outside valve motion which extended above the footplate line. These boxes were often confused for toolboxes.
Initially the D49s were known for poor riding. After experiments with a variety of spring arrangements, this was eventually reduced to acceptable levels in 1934. One of the experiments involved a set of fifteen-plate laminated springs 0.5in thick that were the result of discussions between Stamer, Gresley, and Stanier. Although this design gave good initial results, frequent spring plate breakages started to occur. The final design was modified to have sixteen plates that were 5in wide.
The NE Area had a major re-allocation of D49s in 1939. By September 1939, the D49/2s were allocated to Neville Hill (15), York (10), Gateshead (8), Scarborough (5), and Botanic Gardens (4). All eleven NE Area D49/1s were allocated to Botanic Gardens. Allocations remained virtually constant until after Nationalisation (1948). Wartime conditions resulted in less services that suited the D49's abilities. Instead they were often called upon to haul heavy 350-400 ton trains, but they managed this with only a loss of a minute or two on their moderate length journeys."
)
)